Отправка Viber-сообщенй 
=======================

Отправка сообщения на один номер (POST)
---------------------------------------

Сервис инициирует отправку Viber-сообщения в соответствии со значениями параметров, передаваемых сервису в POST-запросе следующего формата:

.. code-block:: json

   /api/v1/viber/message?phone=<Номер получателя>&viber_sender_name=<Имя отправителя Viber>&text=<Текст сообщения>&image_url=<URL картинки>&button=<Текст кнопки>&button_action=<URL-ссылка>&can_send_sms=<Перенаправить как SMS>&sms_sender_name=<Имя SMS-отправителя>&local_time=<Учет часового пояса получателя>
   
Параметры запроса:
 
+----------------------+------------+--------------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                            |Обязательный  |
+======================+============+========================================================+==============+
| phone                |   string   |  Номер получателя                                      |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| viber_sender_name    |   string   |  Имя отправителя Viber                                 |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| text                 |   string   |  Текст сообщения                                       |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| image_url            |   string   |  URL картинки                                          |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| button               |   string   |  Текст кнопки                                          |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| button_action        |   string   |  URL-ссылка                                            |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| can_send_sms         |   boolean  |  Перенаправить как SMS                                 |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| sms_sender_name      |   string   |  Имя SMS-отправителя                                   |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| local_time           |   boolean  |  Учет часового пояса получателя                        |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+

Пример овтета:

.. code-block:: json

   {
      "id": 0,
      "campaign_id": 0,
      "subscriber_id": 0,
      "status": "string",
      "code": "string",
      "error": "string",
      "created_at": "2018-05-03T09:45:06.829Z"
   }
   
 
Параметры ответа:
 
+----------------------+------------+--------------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                            |Обязательный  |
+======================+============+========================================================+==============+
| id                   |   integer  |  Идентификатор Viber-сообщения                         |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| campaign_id          |   integer  |  Идентификатор кампании                                |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| subscriber_id        |   integer  |  Идентификатор получателя                              |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| status               |   string   |  Статус Viber-сообщения                                |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| code                 |   string   |  Код ответа                                            |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| error                |   string   |  Ошибка                                                |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| created_at           |   string   |  Дата создания сообщения                               |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+


Отправка нескольких сообщений на один номер (POST)
--------------------------------------------------

Сервис инициирует отправку Viber-сообщения в соответствии со значениями параметров, передаваемых сервису в POST-запросе следующего формата:

.. code-block:: json

   /api/v1/viber/messages?phones=<Номера получателей>&viber_sender_name=<Имя отправителя Viber>&text=<Текст сообщения>&image_url=<URL картинки>&button=<Текст кнопки>&button_action=<URL-ссылка>&can_send_sms=<Перенаправить как SMS>&sms_sender_name=<Имя SMS-отправителя>&local_time=<Учет часового пояса получателя>
   
Параметры запроса:
 
+----------------------+------------+--------------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                            |Обязательный  |
+======================+============+========================================================+==============+
| phones               |   string   |  Номера получателей                                    |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| viber_sender_name    |   string   |  Имя отправителя Viber                                 |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| text                 |   string   |  Текст сообщения                                       |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| image_url            |   string   |  URL картинки                                          |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| button               |   string   |  Текст кнопки                                          |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| button_action        |   string   |  URL-ссылка                                            |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| can_send_sms         |   boolean  |  Перенаправить как SMS                                 |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| sms_sender_name      |   string   |  Имя SMS-отправителя                                   |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| local_time           |   boolean  |  Учет часового пояса получателя                        |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+

Пример овтета:

.. code-block:: json

   {
      "id": 0,
      "campaign_id": 0,
      "subscriber_id": 0,
      "status": "string",
      "code": "string",
      "error": "string",
      "created_at": "2018-05-03T09:45:06.829Z"
   }
   
 
Параметры ответа:
 
+----------------------+------------+--------------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                            |Обязательный  |
+======================+============+========================================================+==============+
| id                   |   integer  |  Идентификатор Viber-сообщения                         |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| campaign_id          |   integer  |  Идентификатор кампании                                |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| subscriber_id        |   integer  |  Идентификатор получателя                              |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| status               |   string   |  Статус Viber-сообщения                                |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| code                 |   string   |  Код ответа                                            |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| error                |   string   |  Ошибка                                                |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| created_at           |   string   |  Дата создания сообщения                               |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+


Получение списка Viber-сообщений (GET)
--------------------------------------

Возвращает список сообщений.

.. code-block:: json

   /api/v1/viber/messages?page=<Номер страницы>&per_page=<Кол-во записей>
   
Параметры запроса:
 
+----------------------+------------+--------------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                            |Обязательный  |
+======================+============+========================================================+==============+
| page                 |   integer  |  Номер страницы                                        |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+
| per_page             |   integer  |  Кол-во записей                                        |       Нет    |
+----------------------+------------+--------------------------------------------------------+--------------+


Запрос статуса Viber-сообщения (GET)
------------------------------------

Сервис возвращает статус отправленного Viber-сообщения в соответствии со значениями параметров, передаваемых сервису в GET-запросе следующего формата:

.. code-block:: json

   /api/v1/viber/messages/{id}
 
Параметры запроса:
 
+----------------------+---------------+----------------------------------------------------+--------------+
|      Параметр        | Тип данных    |    Описание                                        |Обязательный  |
+======================+===============+====================================================+==============+
| id                   | integer       |  Идентификатор Viber-сообщения                     |        Да    |
+----------------------+---------------+----------------------------------------------------+--------------+


Запрос статистики за период (GET)
---------------------------------

Сервис возвращает входящие sms-сообщения за период в соответствии со значениями параметров, передаваемых сервису в GET-запросе следующего формата:

.. code-block:: json

   /api/v1/viber/statistics?start_date=<Дата начала выборки>&end_date=<Дата окончания>&page=<Номер страницы>&per_page=<Кол-во записей>
   
Параметры запроса:
 
+----------------------+------------+----------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                        |Обязательный  |
+======================+============+====================================================+==============+
| start_date           |   date     |  Дата начала выборки. Формат dd.mm.yyyy            |       Да     |
+----------------------+------------+----------------------------------------------------+--------------+
| end_date             |   date     |  Дата конца выборки. Формат dd.mm.yyyy             |       Да     |
+----------------------+------------+----------------------------------------------------+--------------+
| page                 |   integer  |  Номер страницы                                    |       Нет    |
+----------------------+------------+----------------------------------------------------+--------------+
| per_page             |   integer  |  Кол-во записей                                    |       Нет    |
+----------------------+------------+----------------------------------------------------+--------------+

Пример овтета:

.. code-block:: json

   {
      "campaign_id": 0,
      "date": "2018-05-03",
      "enqueued_count": 0,
      "sent_count": 0,
      "readed_count": 0,
      "undelivered_count": 0,
      "sent_by_sms_count": 0
   }
   
   
Параметры ответа:
 
+----------------------+------------+--------------------------------------------------------+--------------+
|      Параметр        | Тип данных |    Описание                                            |Обязательный  |
+======================+============+========================================================+==============+
| campaign_id          |   integer  |  Идентификатор Viber-кампании                          |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| date                 |   string   |  Дата                                                  |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| enqueued_count       |   integer  |  Сообщений в очереди                                   |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| sent_count           |   integer  |  Сообщений на отправку                                 |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| readed_count         |   integer  |  Прочитано сообщений                                   |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| undelivered_count    |   integer  |  Не доставлено сообщений                               |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
| sent_by_sms_count    |   integer  |  Отправлено сообщений как SMS                          |       Да     |
+----------------------+------------+--------------------------------------------------------+--------------+
